import React from 'react';
import axios from 'axios';

const Modal = ({ isOpen, onClose, detailName, formData, handleChange , reportId}) => {
  if (!isOpen) return null;


  
  const handleSubmit = async (e) => {
    e.preventDefault();
    try {
      const token = localStorage.getItem('accessToken');
      const url = `http://188.121.99.245/api/report/checklist/${detailName}`;
      formData.report_id = reportId;
      const response = await axios.post(url, formData, {
        headers: {
          'Authorization': `Bearer ${token}`,
          'Content-Type': 'application/json'
        }
      });
      console.log('با موفقیت ارسال شد:', response.data);
      // Handle success response
      onClose(); // Close the modal after successful form submission
    } catch (error) {
      console.error('خطا در ارسال :', error);
      // Handle error
    }
  };


  console.log("handleSubmi", formData);
  console.log("detailName :", detailName);
const CHECKLIST_DATA = {
  "ExaminingTheFiringCost": {
    "detailName": "ExaminingTheFiringCost",
    "name_fa": "بررسی عملیات خسارت آتش سوزی",
    "column_names": {
        "Insurance_number": "شماره بیمه نامه",
        'q1': 'آیا اعلام خسارت توسط بیمه گزار انجام شده است؟',
        'q2': 'آیا فرم یا نامه اعلام خسارت در دفتر اندیکاتور شعبه ثبت گردیده است؟',
        'q3': 'آیا صورتحساب تفصیلی بیمه نامه اخذ گردیده است؟',
        'q4': 'صرف نظر از قابل پرداخت بودن یا نبودن خسارت، حداکثر ظرف مدت سه روز از تاریخ اعلام خسارت ، پرونده می بایست در سیستم فناوران با نام کاربری کارشناس محترم خسارت شعبه ثبت گردد آیا موارد فوق رعایت گردیده است.',
        'q5': 'آیا مبلغ برآوردی خسارت در برنامه فناوران درج گردیده است؟',
        'q6': 'در خسارتهای گروهی که بیمه گذار یک نهاد یا سازمان می باشد درج نام زیاندیده در شرح خسارت فناوران ضروری می باشد. آیا موارد فوق رعایت گردیده است؟',
        'q7': 'قبل از صدور حواله هر خسارت یا قسمتی از آن میبایست مبلغ معوق (برآوردی) ابتدا متناسب با آن تعدیل و سپس حواله خسارت صادر گردد .آیا موارد فوق رعایت گردیده است؟',
        'q8': 'در صورتی که اعلام خسارت در شعبه دیگری به غیر از شعبه صادر کننده بیمه نامه صورت گیرد ، آن شعبه میبایست بالادرنگ مراتب را از طریق اتوماسیون اداری به شعبه صادر کننده بیمه نامه با رونوشت اداره خسارت آتش سوزی و مهندسی اعلام نماید آیا موارد فوق رعایت گردیده است؟',
        'q9': 'اخذ سند مالکیت',
        'q10': 'اخذ قبوض خدماتی',
        'q11': 'اخذ پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گذار',
        'q12': 'اخذصورت ریز گردش مواد اولیه شامل موجودی اول دوره و خرید طی دوره',
        'q13': 'اخذ صورت ریز گردش محصول اعم از ورود به خط تولید و موجودی آخر دوره',
        'q14': 'در صورت وقوع سیل، طوفان و صاعقه آیا از سازمان هواشناسی تائیدیه اخذ گریده است؟',
        'q15': 'آیا از سازمان آتشنشانی تائیدیه اخذ گردیده است؟',
        'q16': 'در صورت وقوع زلزله از سازمان ژئوفیزیک تائیدیه اخذ گردیده است؟',
                                            'q17': 'استعلام از سایر شرکت های بیمه برای کلیه حوادث ناشی از جریان برق و یا گاز الزامی بوده و در سایر حوادث تا سقف مبلغ خسارت 500.000.000 ریال نیاز نمیباشد . آیا موارد فوق رعایت گردیده است؟',
        'q18': 'در صورتی که گیرنده حواله (ذینفع بیمه نامه ) با بیمه گذار متفاوت بوده امضا و تایید فرم "رسید تسویه خسارت " توسط بیمه گذار نیز الزامی است. آیا مواردفوق رعایت گردیده است؟',
         'q19': 'آیا مدارک با فرمت pdf در فناوران بارگزاری شده است؟',
                                            'q20': 'در صورتی که مبلغ خسارت قابل پرداخت از 1.000.000.000 ریال بیشتر باشد اخذ رضایت نامه محضری از گیرنده حواله الزامیست.آیا موارد فوق رعایت گردیده است؟',
        'q21': 'در خصوص خسارت های مربوط به سازمان ها و ارگان های دولتی در صورتی که مبلغ خسارت بیشتر از 1.000.000.000 ریال باشد نیاز به اخذ رضایت نامه محضری نبوده اما مبلغ خسارت می بایست بعد از مکاتبه توسط بیمه گذار کتبا مورد تائید قرار گیرد .آیا موارد فوق رعایت گردیده است؟',
         'q22': 'آیا فرم آنالیز خسارت تکمیل شده است؟',
         'q23': 'آیا فرم آنالیز خسارت حداقل دارای 2 امضاء مجاز شعبه می باشد'}},

         
"ExaminingTheFiringIssuance": {
  "detailName": "ExaminingTheFiringIssuance",
  "name_fa": "بررسی عملیات صدور آتش سوزی",
                               "column_names": {
             "total_cost": "مبلغ",
             "Insurance_number": "شماره بیمه نامه",
             'q1': 'کنترل الحاق فرم پیشنهاد به پرونده',
             'q2': 'کنترل تکمیل فرم پیشنهاد به صورت کامل ',
             'q3': 'درصورتی که بیمه نامه تمدیدی باشد آیا نامه (بیمه گزار)جهت تمدید بیمه نامه اخذ گردیده است؟ ',
             'q4': 'کنترل تایید فرم پیشنهاد توسط بیمه گزار حقیقی ',
             'q5': 'کنترل مهر فرم پیشنهاد تکمیل شده توسط بیمه گزار حقوقی ',
                                                'q6': 'کنترل نسخه بایگانی بیمه نامه به پرونده آن الصاق گردیده است ',
                                                'q7': 'کنترل مهر و امضاء واحد معرف (در صورتی که معرف نماینده است) در ذیل فرم پیشنهاد ',
                                                'q8': ' کنترل بارگذاری عکس ها و فرم بازدید اولیه در سیستم فناوران قسمت بازدید آتش سوزی در صورت نیاز مورد بیمه به بازدید',
                                                'q9': 'وصول حق بیمه در موعد مقرر (طبق شیوه نامه)',
                                                'q10': 'همخوانی اطلاعات مندرج در فرم پیشنهاد با بیمه نامه صادره',
                                                'q11': 'درج کامل نشانی مورد بیمه  شامل شهر، خیابان اصلی و فرعی، کوچه،  شماره طبقه و واحد  کد پستی وپلاک ثبتی در فرم پیشنهاد و برنامه فناوران انجام شده است؟ ',
                                                'q12': 'آیا نوع فعالیت شغلی به صوررت کامل و صحیح در فرم پیشنهاد و برنامه فناوران درج شده است؟',
                                                'q13': 'فرم پیشنهاد باید فاقد هرگونه خط خوردگی و یا لاک گرفتگی باشد.آیا موارد فوق رعایت گردیده است؟',
                                                'q14': 'در صورت صدور بیمه نامه جهت  انبارهای عمومی آیا مجوز از ستاد اخذ شده است؟ ',
                                                'q15': 'آیا مدارک صدور شامل فرم پیشنهاد و لیست های مربوطه و .... در سیستم فن آوران بارگزاری شده است؟',
                                                'q16': 'درمواردی که لیست تفکیکی وجود دارد آیا لیست از بیمه گزار همراه با امضاء اخذ و بایگانی شده است؟',
                                                'q17': 'برای موارد و خطرات ذیل لیست تفکیکی ضروری است موارد بیمه شامل ماشین آلات، تجهیزات، وسایل نقلیه باشدآیا موارد فوق رعایت گردیده است.',
                                                'q18': 'برای موارد و خطرات ذیل لیست تفکیکی ضروری میباشد.خطرات اضافی شامل: سرقت، نوسانات برق، ترکیدگی ظروف تحت فشار ودفرمگی ظروف تحت فشارآیا موارد فوق رعایت گردیده است ',
                                                'q19': 'برای موارد و خطرات ذیل لیست تفکیکی ضروری میباشد.در صورتی که بخشی از سرمایه یک مورد بیمه برای یک خطر در خواست گردد.آیا موارد فوق رعایت گردیده است',
                                                'q20': 'آیا درج کد پستی به طرز صحیح در برنامه فناوران درج گردیده  است؟'
                                                }},
"ExaminingTheCargoCost": {
  "detailName": "ExaminingTheCargoCost",
  "name_fa": "بررسی عملیات خسارت بیمه های  باربری داخلی",
                          "column_names": {
                              "Insurance_number": "شماره بیمه نامه",
                              'q1': 'آیا بیمه گزار در موعد مقرر اعلام خسارت نموده است؟',
                              'q2': 'آیا فرم یا نامه اعلام خسارت در دفتر اندیکاتور ثبت گردیده است؟',
                              'q3': 'آیا پس از اعلام خسارت بلافاصله در سیستم فناوران خسارت ثبت شده است؟',
                              'q4': 'آیا تصویر بیمه نامه اخذ شده است؟',
                              'q5': 'آیا تصویر تمامی الحاقیه ها (در صورت وجود) اخذ شده است؟',
                              'q6': 'آیا صورتحساب تفصیلی بیمه نامه اخذ شده است؟',
                              'q7': 'آیا آمار عملکرد بیمه گزار(گزارش کد 914125 )در مقطع زمانی یکسال گذشته اخذ شده است؟',
                              'q8': 'آیا فرم پیشنهاد اخذ شده است؟',
                              'q9': 'آیا شرایط عمومی اخذ شده است؟',
                              'q10': 'آیا حواله تسویه خسارت دارای دو امضاء مجاز شعبه می باشد؟',
                              'q11': 'آیا فرم آنالیز محاسبات خسارت باربری تکمیل شده است؟',
                              'q12': 'آیا فرم حواله کارشناسی(در صورت اتمام فرایند کارشناسی پرونده) اخذ و دارای دو امضاء مجاز شعبه می باشد؟',
                              'q13': 'آیا فرم گزارش کارشناسی و بازدید خسارت و عکس های ضمیمه شده است؟ (در صورت نیاز)',
                              'q14': 'آیا اصل بارنامه اخذ شده است؟',
                              'q15': 'آیا فاکتور خرید اخذ شده است؟',
                              'q16': 'اخذ استعلام از سامانه سنهاب بیمه مرکزی در خصوص اعلام خسارت خودرو حمل کالای مورد بیمه',
                              'q17': 'آیا گزارش مقامات انتظامی و صورت مجلس تنظیمی مبنی بر علت و چگونگی حادثه اخذ شده است؟'
                          }},
"ExaminingTheCargoIssuance": {
  "detailName": "ExaminingTheCargoIssuance",
  "name_fa": "بررسی عملیات صدور بیمه های  باربری",
                              "column_names": {
                                  "Insurance_number": "شماره بیمه نامه",
                                  "total_value": "کل حق بیمه",
                                  'q1': 'آیا  پروفرما در واردات وصادرات  اخذ شده است؟',
                                  'q2': 'آیا فرم پیشنهاد  تکمیل گردیده است؟ ',
                                  'q3': 'آیا امضاء و مهر بیمه گزار در فرم پیشنهاد درج گردیه است؟',
                                  'q4': 'آیا موارد درج شده در پروفرما با فرم پیشنهاد و بیمه نامه همخوانی دارد؟',
                                  'q5': 'در صورتیکه کالا در روی عرشه کشتی حمل شود ذکر عبارت حمل روی عرشه و مجاز نمودن آن در بیمه نامه ها ضروری میباشد.آیا موارد فوق رعایت گردیده است؟',
                                  'q6': 'شماره و تاریخ پروفرما(پیش فاکتور)',
                                  'q7': 'آیا دریافت رسید تحویل بیمه نامه اخذ  و بایگانی مستندات انجام شده است؟',
                                  'q8': 'آیا حق بیمه براساس شیوه نامه دریافت شده است؟',
                                  'q9': 'آیا یک نسخه از بیمه نامه بایگانی گردیده است؟',
                                  'q10': 'آیا رسید وصول حق بیمه (اعلام بدهکار) اخذ و بایگانی گردیده است؟',
                                  'q11': 'چنانچه وسیله حمل، کشتی طبقه بندی شده باشد درج متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                  'q12': 'چنانچه طبق فرم پیشنهاد تکمیل شده توسط بیمه گذار درخواست شده باشد که مورد بیمه تا بندر مقصد داخل کانتینر حمل گردد،  درج متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                  'q13': 'چنانچه طبق فرم پیشنهاد تکمیل شده توسط بیمه گذار درخواست شده باشد که مورد بیمه در حمل دریایی- زمینی تا مقصد نهایی داخل کانتینر حمل گردد، درج متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                  'q14': 'چنانچه طبق فرم پیشنهاد تکمیل شده توسط بیمه گذار درخواست شده باشد که مورد بیمه با کانتینر یخچالدار حمل گردد درج متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                  'q15': 'درصورتیکه طبق فرم پیشنهاد تکمیل شده توسط بیمه گذار حمل کالا روی عرشه مجاز شده باشد و اگر کالا داخل کانتینر باشد درج  متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                  'q16': 'درصورتیکه مورد بیمه،کالاهای از قبیل دارو، مواد اولیه دارو، چسب مایع و در مجموع نسبت به تغییرات دما حساس باشد درج  متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                  'q17': 'بیمه گذار موظف است شرایط و دمای مناسب جهت حمل و نگهداری کالای بیمه شده را کتبا به متصدی حمل اعلام و درج  متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                  'q18': 'در بیمه های باربری وارداتی / صادراتی و در زمان حمل داخلی بیمه گذار موظف به تهیه بارنامه به ارزش واقعی می باشد علام و درج  متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                  'q19': 'در بیمه های باربری وارداتی / صادراتی و در زمان حمل داخلی بیمه گذار موظف به تهیه بارنامه به ارزش واقعی می باشد درج  متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                  'q20': 'درصورت حمل کالا بدون کانتینر خسارت وارده به نسبت حق بیمه پرداخت شده به حق بیمه ای که می بایست پرداخت شود تسویه خواهد شد."درج  متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                  'q21': 'در صورت ارائه پوشش توتالالس، درج شرط ذیل در شرایط خصوصی الزامی می باشددرج  متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                  'q22': 'در صورت حمل کالا با موتور لنج درج شرط ذیل در شرایط خصوصی الزامی می باشددرج  متن مربوطه (طبق شیوه نامه) در شرایط خصوصی بیمه نامه درج گردیده است؟'
                              }},
"ExaminingTheCargoCostExport": {
  "detailName": "ExaminingTheCargoCostExport",
  "name_fa": "بررسی عملیات خسارت بیمه های  باربری صادراتی",
                                "column_names": {
                                    "Insurance_number": "شماره بیمه نامه",
                                    "total_value": "کل حق بیمه",
                                    'q1': 'آیا بیمه گزار در موعد مقرر اعلام خسارت نموده است؟',
                                    'q2': 'آیا فرم یا نامه اعلام خسارت در دفتر اندیکاتور ثبت گردیده است؟',
                                    'q3': 'آیا پس از اعلام خسارت بلافاصله در سیستم فناوران خسارت ثبت شده است؟',
                                    'q4': 'آیا تصویر بیمه نامه اخذ شده است؟',
                                    'q5': 'آیا تصویر تمامی الحاقیه ها (در صورت وجود) اخذ شده است؟',
                                    'q6': 'آیا صورتحساب تفصیلی بیمه نامه اخذ شده است؟',
                                    'q7': 'آیا آمار عملکرد بیمه گزار(گزارش کد 914125 )در مقطع زمانی یکسال گذشته اخذ شده است؟',
                                    'q8': 'آیا فرم پیشنهاد اخذ شده است؟',
                                    'q9': 'آیا شرایط عمومی اخذ شده است؟',
                                    'q10': 'آیا حواله تسویه خسارت دارای دو امضاء مجاز شعبه می باشد؟',
                                    'q11': 'آیا فرم آنالیز محاسبات خسارت باربری تکمیل شده است؟',
                                    'q12': 'آیا فرم حواله کارشناسی(در صورت اتمام فرایند کارشناسی پرونده) اخذ و دارای دو امضاء مجاز شعبه می باشد؟',
                                    'q13': 'آیا فرم گزارش کارشناسی و بازدید خسارت و عکس های ضمیمه شده است؟',
                                    'q14': 'آیا صورت عدل بندی یا صورت بسته بندی اخذ شده است؟',
                                    'q15': 'آیا سیاهه خرید، فاکتور خرید اخذ شده است؟',
                                    'q16': 'آیا پیش فاکتور اخذ شده است؟ ',
                                    'q17': 'آیا بارنامه حمل اخذ شده است؟',
                                    'q18': 'آیا  گزارش مقامات انتظامی در صورت وقوع حادثه اخذ شده است؟'
                                }},
"ExaminingTheCargoCostImport": {
  "detailName": "ExaminingTheCargoCostImport",
  "name_fa": "بررسی عملیات خسارت بیمه های  باربری وارداتی",
                                "column_names": {
                                    "Insurance_number": "شماره بیمه نامه",
                                    "total_value": "کل حق بیمه",
                                    'q1': 'آیا بیمه گزار در موعد مقرر اعلام خسارت نموده است؟',
                                    'q2': 'آیا فرم یا نامه اعلام خسارت در دفتر اندیکاتور ثبت گردیده است؟',
                                    'q3': 'آیا پس از اعلام خسارت بلافاصله در سیستم فناوران خسارت ثبت شده است؟',
                                    'q4': 'آیا تصویر بیمه نامه اخذ شده است؟',
                                    'q5': 'آیا تصویر تمامی الحاقیه ها (در صورت وجود) اخذ شده است؟',
                                    'q6': 'آیا صورتحساب تفصیلی بیمه نامه اخذ شده است؟',
                                    'q7': 'آیا آمار عملکرد بیمه گزار(گزارش کد 914125 )در مقطع زمانی یکسال گذشته اخذ شده است؟',
                                    'q8': 'آیا پروفرما اخذ شده است؟',
                                    'q9': 'آیا ثبت سفارش اخذ شده است؟ثبت سفارش',
                                    'q10': 'آیا فرم پیشنهاد اخذ شده است؟',
                                    'q11': 'آیا شرایط عمومی اخذ شده است؟',
                                    'q12': 'آیا فرم کلوزی که بیمه نامه بر اساس آن صادر شده است. اخذ شده است؟',
                                    'q13': 'آیا حواله تسویه خسارت دارای دو امضاء مجاز شعبه می باشد؟',
                                    'q14': 'آیا فرم آنالیز محاسبات خسارت باربری تکمیل شده است؟',
                                    'q15': 'آیا فرم حواله کارشناسی(در صورت اتمام فرایند کارشناسی پرونده) اخذ و دارای دو امضاء مجاز شعبه می باشد؟',
                                    'q16': 'آیا فرم گزارش کارشناسی و بازدید خسارت و عکس های ضمیمه شده است؟',
                                    'q17': 'آیا بارنامه حمل اخذ شده است؟',
                                    'q18': 'آیا فاکتور خرید و پیش فاکتور اخذ شده است؟',
                                    'q19': 'آیا  قبوض انبار گمرکی اخذ شده است؟',
                                    'q20': 'آیا صورت مجلس گمرکی یا بندری اخذ شده اشت؟',
                                    'q21': 'آیا قبض باسکول درب خروج گمرک اخذ شده است؟',
                                    'q22': 'آیا گزارش مقامات انتظامی در صورت وقوع حادثه اخذ شده است؟'
                                }},
"ExaminingTheCarCostBodyInit": {
  "detailName": "ExaminingTheCarCostBodyInit",
  "name_fa": "بررسی عملیات بازدید اولیه رشته خودرو بدنه",
                                "column_names": {
                                    "Insurance_number": "شماره بیمه نامه",
                                    "total_value": "کل حق بیمه",
                                    'q1': 'آیا تصویر بیمه نامه بدنه و بیمه نامه شخص ثالث یا رونوشت آن به همراه الحاقیه های مربوطه اخذ و بارگزاری شده است؟',
                                    'q2': 'آیا تصویر (کارت خودرو - گواهینامه - مدارک شناسائی - کارت سبز خودرو ) مربوط به زیاندیده اخذ و بارگزاری شده است ؟',
                                    'q3': 'آیا تصویر فرم اعلام خسارت تکمیل و در برنامه فناوران بارگزاری شده است؟',
                                    'q4': 'آیا تصویر صورتحساب تفصیلی از برنامه فناوران اخذ و بارگذاری شده است؟',
                                    'q5': 'آیا تصویر استعلام خسارت "سنهاب" مربوط به بیمه گزار و راننده و خودرو اخذ و بارگزاری شده است؟',
                                    'q6': 'آیا ارزش روز خودرو در فرم کارشناسی لحاظ شده است؟',
                                    'q7': 'آیا تصویر فاکتورهای خرید لوازم ،اجرت تعمیر و تعویض بارگزاری شده است؟',
                                    'q8': 'آیا تصاویر خسارت مربوط به خودرو  بارگزاری شده است؟',
                                    'q9': 'آیا تصاویر داغی و لیست مربوطه در صورت تحویل به شعبه بارگزاری شده است؟',
                                    'q10': 'در صورت فروش داغی ها آیا بخشنامه مدیریت خودرو رعایت گردیده است؟',
                                    'q11': 'آیا تصویر مربوط به فرم کارشناسی ارزیاب خسارت  بارگزاری شده است؟',
                                    'q12': 'آیا تصویر فرم کارشناسی ارزیاب خسارت به امضاء زیاندیده و کارشناس ارزیاب رسیده است؟',
                                    'q13': 'آیا تصاویر حواله های ممهور و امضا شده خسارت بارگزاری شده است؟',
                                    'q14': 'آیا تصویر چک لیست تکمیل و تائید شده توسط شعبه بارگزاری شده است؟',
                                    'q15': 'آیا تصویر فرم تکمیل وتائید شده تسویه خسارت بارگزاری شده است؟',
                                    'q16': 'آیاتصویر فرم تکمیل شده شورای خسارت تکمیل و بارگزاری شده است؟',
                                    'q17': 'آیا مبلغ حق بیمه در موعد مقرر تسویه شده است ؟',
                                    'q18': 'آیا کاربری خودرو در بیمه نامه با زمان حادثه همخوانی دارد؟',
                                    'q19': 'آیا از شماره شاسی حک شده خودرو مقصر حادثه تصویر اخذ وبارگزاری شده است؟',
                                    'q20': 'آیا در صورت نیاز به کروکی اخذ شده است؟',
                                    'q21': 'آیا در صورت داشتن مقصر حادثه تا سقف خسارت خودروی متعارف اقدامات لازم جهت انجام ریکاوری انجام شده است؟',
                                    'q22': 'آیا تصویر فرم آنالیز خسارت بارگزاری شده است؟',
                                    'q23': 'آیا فرم آنالیز خسارت به ا مضاء کارشناس رسیده است؟',
                                    'q24': 'آیا فرانشیز برای گواهینامه های زیر 3 سال (10% کل خسارت ) اعمال شده است؟',
                                    'q25': 'آیا استهلاک برای لوازم خودرو که وارد سال پنجم شده اند ( از سال اول  سالی 5% تا سال پنجم حداکثر 25% ) به درستی محاسبه شده است؟',
                                    'q26': 'آیا فرانشیز لوازم از قبیل (باطری و لاستیک 50% وشیشه به تنهایی 20% ) به درستی محاسبه شده است؟ ',
                                    'q27': 'آیا فرانشیز خسارت (سال اول 10% از کل خسارت حداقل 500.000 ریال سال دوم 20% حداقل 1.000.000 ریال  تا سال سوم 30% حداقل 1.500.000 ریال ) محاسبه گردیده است ؟',
                                    'q28': 'در صورتی که ارزش روز خودرو از زمان صدور بیمه نامه افزایش داشته آیا ماده 10اعمال شده است؟ (به شرطی که پوشش نوسان نداشته باشد)'
                                }},
"ExaminingTheCarCostBody": {
  "detailName": "ExaminingTheCarCostBody",
  "name_fa": "بررسی عملیات خسارت رشته خودرو - بدنه",
                            "column_names": {
                                "Insurance_number": "شماره بیمه نامه",
                                "total_value": "کل حق بیمه",
                                'q1': 'آیا تصویر بیمه نامه بدنه و بیمه نامه شخص ثالث یا رونوشت آن به همراه الحاقیه های مربوطه اخذ و بارگزاری شده است؟',
                                'q2': 'آیا تصویر (کارت خودرو - گواهینامه - مدارک شناسائی - کارت سبز خودرو ) مربوط به زیاندیده اخذ و بارگزاری شده است ؟',
                                'q3': 'آیا تصویر فرم اعلام خسارت تکمیل و در برنامه فناوران بارگزاری شده است؟',
                                'q4': 'آیا تصویر صورتحساب تفصیلی از برنامه فناوران اخذ و بارگذاری شده است؟',
                                'q5': 'آیا تصویر استعلام خسارت "سنهاب" مربوط به بیمه گزار و راننده و خودرو اخذ و بارگزاری شده است؟',
                                'q6': 'آیا ارزش روز خودرو در فرم کارشناسی لحاظ شده است؟',
                                'q7': 'آیا تصویر فاکتورهای خرید لوازم ،اجرت تعمیر و تعویض بارگزاری شده است؟',
                                'q8': 'آیا تصاویر خسارت مربوط به خودرو  بارگزاری شده است؟',
                                'q9': 'آیا تصاویر داغی و لیست مربوطه در صورت تحویل به شعبه بارگزاری شده است؟',
                                'q10': 'در صورت فروش داغی ها آیا بخشنامه مدیریت خودرو رعایت گردیده است؟',
                                'q11': 'آیا تصویر مربوط به فرم کارشناسی ارزیاب خسارت  بارگزاری شده است؟',
                                'q12': 'آیا تصویر فرم کارشناسی ارزیاب خسارت به امضاء زیاندیده و کارشناس ارزیاب رسیده است؟',
                                'q13': 'آیا تصاویر حواله های ممهور و امضا شده خسارت بارگزاری شده است؟',
                                'q14': 'آیا تصویر چک لیست تکمیل و تائید شده توسط شعبه بارگزاری شده است؟',
                                'q15': 'آیا تصویر فرم تکمیل وتائید شده تسویه خسارت بارگزاری شده است؟',
                                'q16': 'آیاتصویر فرم تکمیل شده شورای خسارت تکمیل و بارگزاری شده است؟',
                                'q17': 'آیا مبلغ حق بیمه در موعد مقرر تسویه شده است ؟',
                                'q18': 'آیا کاربری خودرو در بیمه نامه با زمان حادثه همخوانی دارد؟',
                                'q19': 'آیا از شماره شاسی حک شده خودرو مقصر حادثه تصویر اخذ وبارگزاری شده است؟',
                                'q20': 'آیا در صورت نیاز به کروکی اخذ شده است؟',
                                'q21': 'آیا در صورت داشتن مقصر حادثه تا سقف خسارت خودروی متعارف اقدامات لازم جهت انجام ریکاوری انجام شده است؟',
                                'q22': 'آیا تصویر فرم آنالیز خسارت بارگزاری شده است؟',
                                'q23': 'آیا فرم آنالیز خسارت به ا مضاء کارشناس رسیده است؟',
                                'q24': 'آیا فرانشیز برای گواهینامه های زیر 3 سال (10% کل خسارت ) اعمال شده است؟',
                                'q25': 'آیا استهلاک برای لوازم خودرو که وارد سال پنجم شده اند ( از سال اول  سالی 5% تا سال پنجم حداکثر 25% ) به درستی محاسبه شده است؟',
                                'q26': 'آیا فرانشیز لوازم از قبیل (باطری و لاستیک 50% وشیشه به تنهایی 20% ) به درستی محاسبه شده است؟ ',
                                'q27': 'آیا فرانشیز خسارت (سال اول 10% از کل خسارت حداقل 500.000 ریال سال دوم 20% حداقل 1.000.000 ریال  تا سال سوم 30% حداقل 1.500.000 ریال ) محاسبه گردیده است ؟',
                                'q28': 'در صورتی که ارزش روز خودرو از زمان صدور بیمه نامه افزایش داشته آیا ماده 10اعمال شده است؟ (به شرطی که پوشش نوسان نداشته باشد)'
                            }},
"ExaminingTheCarIssuanceBody": {
  "detailName": "ExaminingTheCarIssuanceBody",
  "name_fa": "بررسی عملیات صدور رشته خودرو بدنه",
                                "column_names": {
                                    "Insurance_number": "شماره بیمه نامه",
                                    "total_value": "کل حق بیمه",
                                    'q1': 'آیا اصل بیمه نامه سال قبل (درصورت وجود سابقه) اخذ گردیده است؟',
                                    'q2': 'آیا فرم پیشنهاد اخذ و مندرجات موجود به درستی تکمیل و در سیستم فناوران بارگذاری شده است؟',
                                    'q3': 'آیا اخذ درخواست در خصوص بیمه گزاران حقوقی صورت پذیرفته ؟',
                                    'q4': 'آیا فرم بازدید اولیه تکمیل وبه امضاء بیمه گزاررسیده ودرسیستم فن آوران بارگذاری گردیده است ؟',
                                    'q5': 'آیا عکسهای بازدید اولیه در سیستم فن آوران بارگذاری گردیده است ؟',
                                    'q6': 'کنترل الحاق سند یا فاکتور در صورت استفاده از تخفیف صفر کیلومتر(20%)',
                                    'q7': 'آیا در خصوص تخفیفات سنواتی استعلامات ( سامانه سنهاب و یا بیمه گر سال قبل) اخذ بارگذاری گردیده ؟ ',
                                    'q8': 'آیا مدارک شناسائی بیمه گزار (از قبیل رونوشت کارت ملی و ......)ومدارک شناسائی خودرو(از قبیل کارت خودرو و یا سند مالکیت)در سیستم فناوران بارگذاری شده است؟',
                                    'q9': 'درصورتیکه بیمه گزار ومالک خودرو متفاوت باشد آیا فیلد ذینفعان غیر بانکی در سیستم فن آوران ثبت وتکمیل گردیده است ؟',
                                    'q10': 'کنترل تخفیف نقدی (10%)',
                                    'q11': 'کنترل تخفیفات سنواتی در صورت داشتن سوابق (سال اول 25% - سال دوم 35% - سال سوم 45% و تا سال چهارم سقف 60%)',
                                    'q12': 'کنترل عدم اعمال تخفیفات سنواتی از بیمه گزار قبلی به بیمه گزار جدید',
                                    'q13': 'بررسی قرارداد 1471 تمدید اقساط (بیمه نامه های تمدیدی اقساطی بیمه دی )',
                                    'q14': 'بررسی قرارداد 1472 تمدید نقد (بیمه نامه های تمدیدی نقدی بیمه دی )',
                                    'q15': 'کنترل رعایت بخشنامه در خصوص عدم پوشش سرقت در جای قطعات206'
                                }},
"ExaminingTheCarCostThirdPersonFinancial": {
  "detailName": "ExaminingTheCarCostThirdPersonFinancial",
  "name_fa": "بررسی عملیات خسارت رشته شخص ثالث - مالی",
                                            "column_names": {
                                                "Insurance_number": "شماره بیمه نامه",
                                                "total_value": "کل حق بیمه",
                                                'q1': 'آیا تصویر بیمه نامه شخص ثالث یا رونوشت آن و الحاقیه های مربوط به بیمه نامه مقصر حادثه( در صورت موجود) بارگزاری گردیده؟',
                                                'q2': 'آیا تصویر بیمه نامه شخص ثالث یا رونوشت آن ،  مربوط به زیاندیده اخذ و بارگزاری شده است ؟',
                                                'q3': 'آیا تصویر (کارت خودرو - گواهینامه - مدارک شناسائی) مربوط به زیاندیده اخذ و بارگزاری شده است ؟',
                                                'q4': 'آیا تصویر (کارت خودرو - گواهینامه - مدارک شناسائی) مربوط به مقصر حادثه اخذ و بارگزاری شده است ؟',
                                                'q5': 'آیا تصویر فرم اعلام خسارت اخذ و تکمیل وبارگزاری شده است ؟',
                                                'q6': 'آیا تصویر فاکتورهای خر ید لوازم ،اجرت تعمیر و تعویض بارگزاری شده است؟',
                                                'q7': 'آیا تصاویر خسارت مر بوط به خودرو مقصر حادثه و زیان دیده حادثه بارگزاری شده است؟',
                                                'q8': 'آیا در صورت تحویل داغی به شعبه تصاویر داغیها بارگزاری شده است؟',
                                                'q9': 'آیا تصویر مربوط به فرم کارشناسی ارزیاب خسارت  بارگزاری شده است؟',
                                                'q10': 'آیا تصویر  فرم کارشناسی ارزیاب خسارت  به  امضاء زیاندیده و کارشناس ارزیاب رسیده است؟',
                                                'q11': 'آیا تصاویر حواله های ممهور و امضا شده خسارت بارگزاری شده است؟',
                                                'q12': 'آیا تصویر چک لیست تکمیل و تائید شده توسط شعبه بارگزاری شده است؟',
                                                'q13': 'آیا تصویر فرم تکمیل وتائید شده تسویه خسارت بارگزاری شده است؟',
                                                'q14': 'آیاتصویر فرم تکمیل شده شورای خسارت تکمیل و بارگزاری شده است؟',
                                                'q15': 'آیا تصویر فرم صورتحساب تفصیلی بیمه نامه بارگزاری شده است؟',
                                                'q16': 'آیا مبلغ حق بیمه در موعد مقرر تسویه شده است ؟',
                                                'q17': 'آیا کاربری خودرو در بیمه نامه با زمان حادثه (ماده 13 ) جهت محاسبه قاعده نسبی همخوانی دارد؟',
                                                'q18': 'آیا خسارت فوق دارای خسارت جانی نیز میباشد ( ماده 14 )که مشمول ریکاوری 2.5% مبلغ خسارت کل شود؟',
                                                'q19': 'آیا از شماره شاسی حک شده خودرو مقصر حادثه تصویر اخذ وبارگزاری شده است؟',
                                                'q20': 'آیا در صورت نیاز به کروکی اخذ شده است؟',
                                                'q21': 'آیا تصویر استعلام سنهاب مربوط به بیمه گزار و ومقصر حادثه وزیان دیده حادثه اخذ و بارگزاری شده است؟',
                                                'q22': 'اعمال ریکاوری کل خسارت در ماده 15 (رانندگی بدون گواهینامه ونا متناسب بودن گواهینامه با خودرو)',
                                                'q23': 'اعمال خودروی نا متعارف ( ماده 8 ) معادل 50% دیه یک فرد در ماه حرام می باشد که در سال 1402 معادل 6.000.000.000 ریال می باشد '
                                            }},
"ExaminingTheCarCostThirdPersonLife": {
  "detailName": "ExaminingTheCarCostThirdPersonLife",
  "name_fa": "بررسی عملیات خسارت رشته شخص ثالث - جانی",
                                       "column_names": {
                                           "Insurance_number": "شماره بیمه نامه",
                                           "total_value": "کل حق بیمه",
                                           'q1': 'آیا تصویر بیمه نامه شخص ثالث و استعلام از سامانه سنهاب اخذ و بارگزاری شده است؟',
                                           'q2': 'آیا تصویر گواهینامه رانندگی مقصر حادثه  اخذ و بارگزاری شده است؟',
                                           'q3': 'آیا  تصویر مدارک شناسایی (کارت ملی )مقصر حادثه و کارت مشخصات خودرو اخذ و بارگزاری شده است؟ ',
                                           'q4': 'آیا تصویر کروکی تصادف اخذ و بارگزاری شده است؟  ',
                                           'q5': 'آیا فرم اعلام خسارت درست محاسبه و تکمیل و بارگزاری شده است؟ ',
                                           'q6': 'آیا تصویر صورتجلسه وگزارش پاسگاه انتظامی وقضایی واوراق بازجویی اخذ و بارگزاری شده است؟',
                                           'q7': 'آیا تصویر مصدق نظریه های پزشکی قانونی اخذ و بارگزاری شده است؟',
                                           'q8': 'در صورتی که در تصادفات صحنه بر هم خورده باشد آیا تصویر  مصدق مدارک پزشکی و بالینی مجروحین اخذ و بارگزاری شده است؟',
                                           'q9': 'آیا نظریه پزشک معتمد و ارزیاب خسارت در پرونده بایگانی گردیده ؟',
                                           'q10': 'آیا تصویر مصدق برگ اورژانس اخذ و بارگزاری شده است؟',
                                           'q11': 'آیا تصویر مصدق حکم صادره دادگاه اولیه ، دادگاه تجدید نظر یا آخرین حکم مراجع رسیدگی کننده اخذ و بارگزاری شده است؟',
                                           'q12': 'آیا تصویر مصدق کارت ملی مصدومین اخذ و بارگزاری شده است؟',
                                           'q13': 'آیا گزارش معاینه جسد متوفی با درج علت فوت جواز دفن وگواهی صدمات غیر مسری اخذ و بارگزاری شده است؟',
                                           'q14': 'آیا تصویر جواز دفن و گواهی فوت متوفی اخذ و بارگزاری شده است؟',
                                           'q15': 'آیا تصویر مصدق گواهی حصر وراثت نامحدود  اخذ و بارگزاری شده است؟',
                                           'q16': 'آیا تصویر شناسنامه و کارت ملی باطل شده متوفی با درج تاریخ فوت و مدارک شناسایی(کارت ملی وشناسنامه )اخذ و بارگزاری شده است؟',
                                           'q17': 'در صورتی که تاریخ حادثه با تاریخ فوت یکی نباشد  مدارک بیمارستانی اخذ و بارگزاری شده است؟',
                                           'q18': 'در صورتی که هر یک از وراث صغیر باشند ارائه شماره حساب از اداره امورسرپرستی دادگستری اخذ و بارگزاری شده است ؟',
                                           'q19': 'استعلام اصالت بیمه نامه همراه با پاسخ شعبه اخذ شده است؟',
                                           'q20': 'آیا تشکیل پرونده بیشتر از 5 روز کاری پس از اخذ اصالت بیمه نامه می باشد ؟',
                                           'q21': 'آیا فرم شورای داخلی شعبه تکمیل و بارگزاری شده است؟',
                                           'q22': 'آیا فرم ریز دیات تکمیل و بارگزاری شده است؟ ',
                                           'q23': 'آیا فرم تسویه خسارت تکمیل و بارگزاری شده است؟',
                                           'q24': 'آیا حق بیمه در زمان مقرر تسویه و پرداخت شده است؟',
                                           'q25': 'آیا ثبت  اطلاعات پرونده در سیستم به طرز صحیح انجام شده است؟',
                                           'q26': 'آیا ابلاغیه ماده 50 در پرونده موجود است؟',
                                           'q27': 'آیا فرم ماده 50 در خصوص حضور احدی از کارشناسان در جلسه دادگاه رعایت گردیده ؟',
                                           'q28': 'آیا لوایح حقوقی در سیستم فن آوران بارگذاری گردیده ؟',
                                           'q29': 'کنترل ریکاوری ماده 14 انجام شده است ؟',
                                           'q30': 'آیا پس از دریافت ریکاوری تسویه آن انجام شده است؟',
                                           'q31': 'کنترل ماده 15 قانون شخص ثالث انجام شده است؟',
                                           'q32': 'کنترل فرم ماده 34 قانون شخص ثالث در خصوص پرداخت علی الحساب',
                                           'q33': 'کنترل فرم ماده 36 قانون شخص ثالث',
                                           'q34': 'آیا درج مهر تحویل مدارک از دادگاه روی اوراق مهم پرونده انجام پذیرفته است؟ ',
                                           'q35': 'آیا کنترل ماده 13 (قانون بیمه قاعده نسبی) بابت کاربری مورد بیمه در زمان صدور بیمه با زمان حادثه انجام شده است ؟',
                                           'q36': 'آیا گواهی واریز جهت ریکاوری  ماده 13 و 21 (قانون شخص ثالث) بابت  صندوق تامین صورت گرفته ؟',
                                           'q37': 'آیا گواهی واریز به صندوق اخذ وبارگذاری گردیده است ؟ ',
                                           'q38': 'آیا کنترل ریکاوری ماده 32 (سهم صندوق تامین خسارت) بابت مابه التفاوت دیه پرداختی با پوشش بیمه در زمان حادثه انجام شده است؟',
                                           'q39': 'آیا نامه اجرای احکام در خصوص پرداخت خسارت توسط شعبه ارسال گردیده؟',
                                           'q40': 'آیا حواله وشبای واریزی ذینفعان مورد کنترل وتایید قرار گرفته است؟ ',
                                           'q41': 'آیا استعلام سنهاب بعداز اتمام کار وقبل از صدور حواله اخذ گردیده ؟',
                                           'q42': 'کنترل درج 3 امضاء مجاز بر روی حواله های خسارت؟'
                                       }},
"ExaminingTheCarIssuanceThirdPerson": {
  "detailName": "ExaminingTheCarIssuanceThirdPerson",
  "name_fa": "بررسی عملیات صدور رشته شخص ثالث",
                                       "column_names": {
                                           "Insurance_number": "شماره بیمه نامه",
                                           "total_value": "کل حق بیمه",
                                           'q1': 'آیا فرم پیشنهاد اخذ و مندرجات موجود به درستی تکمیل و در سیستم فناوران بارگذاری شده است؟',
                                           'q2': 'آیا اخذ درخواست در خصوص بیمه گزاران حقوقی صورت پذیرفته ؟',
                                           'q3': 'آیا مدارک شناسائی بیمه گزار (از قبیل رونوشت کارت ملی و ......)ومدارک شناسائی خودرو(از قبیل کارت خودرو و یا سند مالکیت)در سیستم فناوران بارگذاری شده است؟',
                                           'q4': 'آیا استعلام سنهاب بیمه مرکزی اخذ و در سیستم فناوران بارگذاری شده است؟',
                                           'q5': 'آیا الزامات مدارک مورد نیاز طبق مفاد قرارداد اخذ گردیده ؟',
                                           'q6': 'آیا تخفیفات غیر سنواتی بیش از 2.5% لحاظ گردیده ',
                                           'q7': 'آیا اعمال تخفیفات سنواتی وانتقال آن به اقارب درجه یک به درستی محاسبه ومنقل گردیده ؟',
                                           'q8': 'آیا معرف بیمه نامه در خصوص قراردادهای حقوقی (نامه - درج در مفاد قرارداد) مشخص گردیده ؟'
                                       }},
"ExaminingTheLifeGACost": {
  "detailName": "ExaminingTheLifeGACost",
  "name_fa": "کاربرگ خسارت بیمه عمر و حوادث گروهی",
                           "column_names": {
                               "Insurance_number": "شماره بیمه نامه",
                               "total_value": "کل حق بیمه",
                               'q1': 'آیا اعلام خسارت از سوی بیمه\u200cگزار از طریق نامه کتبی و ممهور نمودن به مهر دبیرخانه و درج تاریخ ورود به شعبه دریافت شده است؟(سمت چپ پرونده فیزیکی خسارت) ',
                               'q2': 'آیا مدارک موردنیاز از سوی بیمه\u200cگزار (برای افراد بازنشسته فیش یا حکم کارگزینی صرفا ممهور به مهر سازمان ) ، گواهی فوت ثبت و احوال و گواهی فوت بیمارستانی یا جواز دفن صرفا می\u200cبایست اصل و یا برابر با اصل دفتر ثبت اسناد و یا ممهور به مهر سازمان مرجع و کپی مدارک شناسایی بیمه شده در صورت اخذ استعلام از سیستم فناوران و بارگذاری در سیستم دریافت شده است؟ (سمت چپ پرونده فیزیکی خسارت)',
                               'q3': 'آیا فرم چک لیست تکمیل ، و رسید تحویل مدارک به بیمه\u200cگزار/ ذینفع توسط کارشناس شعبه ارائه شده است؟',
                               'q4': 'آیا فرم گزارش کارشناسی خسارت و استعلام وضعیت پوشش بیمه\u200cای توسط کارشناس صدور و خسارت شعبه تکمیل شده است؟(سمت راست پرونده فیزیکی خسارت)',
                               'q5': 'آیا پرونده به پزشک معتمد شرکت ارجاع شده است(در صورت نیاز)',
                               'q6': 'آیا پرونده خسارت در شورای فنی شعبه جهت صدور حواله تایید شده است؟ در صورت که مبلغ خسارت بیشتر از اختیارات مدیر شعبه باشد مجوز از ستاد ضمیمه پرونده می\u200cباشد؟(سمت راست پرونده فیزیکی خسارت)',
                               'q7': 'آیا در صورت عدم تایید خسارت در شورای فنی، بصورت مکتوب به بیمه\u200cگزار به همراه شرح عدم تایید خسارت اعلام شده است؟ پرونده در سیستم و پرونده در سیستم مختومه شده است؟(سمت راست پرونده فیزیکی خسارت)',
                               'q8': 'آیا کلیه مکاتبات فی\u200cمابین بیمه\u200cگر و بیمه\u200cگزار به ترتیب تاریخ درج پرونده خسارت شده است؟(سمت راست پرونده فیزیکی خسارت)',
                               'q9': 'آیا صورتحساب تفصیلی بیمه\u200cنامه در پرونده بایگانی فیزیکی شده است؟(سمت راست پرونده فیزیکی خسارت)',
                               'q10': 'آیا پرونده خسارت در سیستم، حداکثر 7 روز پس از ثبت نامه بیمه\u200cگزار در دبیرخانه بیمه\u200cگر ثبت شده است؟'
                           }},
"ExaminingTheLifeGAIssuance": {
  "detailName": "ExaminingTheLifeGAIssuance",
  "name_fa": "کاربرگ صدور عمر و حوادث گروهی",
                               "column_names": {
                                   "Insurance_number": "شماره بیمه نامه",
                                   "total_value": "کل حق بیمه",
                                   'q1': 'آیا درخواست کتبی بیمه\u200cگزار برای مناقصه و یا استعلام نرخ وجود دارد؟',
                                   'q2': 'حق\u200cبیمه مورد محاسبه براساس اطلاعات دریافتی از بیمه\u200cگزار شامل، پوشش های مورد درخواست، سرمایه، خطرات اضافی، تاریخ شروع و پایان بیمه نامه، سقف سنی بیمه شدگان،میانگین سنی بیمه شدگان، نوع فعالیت، گروه بیمه شدگان به تفکیک (شاغل/بازنشسته) و همچنین بیمه شده تبعی (همسر/فرزند/والدین) محاسبه گردیده است؟',
                                   'q3': 'شرایط، تعهدات قابل ارائه  و موارد خارج از تعهد به بیمه\u200cگزار به صورت مکتوب اعلام گردیده است؟',
                                   'q4': 'برای استعلام نرخ و یا مناقصه\u200cهای که در حدود اختیارت شعبه و شبکه فروش نباشد (تعداد بیمه\u200cشدگان بالای 5000 نفر/استعلام نرخ صرفاً برای بازنشستگان/ حق\u200cبیمه بیمه\u200cنامه بالای 4 میلیاردتومان/ سرمایه پوشش\u200cهای بیمه\u200cنامه بالاتر از حدود اختیارات شعبه) از مدیریت بیمه\u200cهای زندگی تاییدیه اعلام نرخ دریافت گردیده است؟',
                                   'q5': ' آیا برای اعلام نرخ، وضعیت بیمه\u200cگزار از نظر پرتفو در سایر رشته\u200cها، ضریب خسارت کلی به همراه سایر رشته\u200cها(بیمه نامه تمدیدی) و حق\u200cبیمه سال گذشته برای هر نفر مورد بررسی قرار گرفته است؟',
                                   'q6': 'در صدور بیمه نامه عمر مانده بدهکار  نرخ براساس میانگین سنی و مدت بازپرداخت به درستی محاسبه شده است؟',
                                   'q7': 'آیا درخواست کتبی بیمه\u200cگزار مبنی بر صدور بیمه نامه (ثبت دبیرخانه شعبه بیمه دی) با شرایط اعلام شده از سوی شرکت بیمه دی  اخذ گردیده است؟',
                                   'q8': 'در صورت داشتن معرف  (نماینده/کارگزار) در بیمه نامه صادره، مشخصات معرف قرارداد در  درخواست کتبی بیمه\u200cگزار جهت صدور درج گردیده است؟',
                                   'q9': 'تمامی مکاتبات شامل اعلام حق\u200cبیمه مکتوب از سوی بیمه\u200cگر، دریافت درخواست صدور از بیمه\u200cگزار، مکاتبات و مجوزهای دریافتی از ستاد در بخش مستندات بیمه نامه  بصورت فیزیکی  و سیستمی در فناوران در بیمه نامه مربوطه بارگذاری گردیده است؟',
                                   'q10': 'تاریخ شروع و  پایان بیمه نامه،  تعهدات، سرمایه هر پوشش، رده سنی هر گروه از بیمه شدگان  مطابق با د رخواست بیمه\u200cگزار و تاییدیه  این شرکت صادر گردیده است؟',
                                   'q11': 'آیا در زمان صدور بیمه نامه  حوادث مسافرتی، درخواست بیمه\u200cگزار از شخصیت حقوقی مانند آژانس\u200cهای مسافرتی برای شخص حقیقی (مسئول آژانس مسافرتی، راهنمای تورو ...) دریافت شده است؟',
                                   'q12': '\xa0\xa0 آیا در زمان صدور بیمه نامه مسافرتی، درج نوع بیمه نامه مسافرتی و نحوه محاسبه کوتاه مدت رعایت شده است؟',
                                   'q13': 'بیمه نامه های که تحت قرارداد و بخشنامه های خاص مانند حوادث دانشجویی، بنگاه های کوچک  صادر گردیده است؟',
                                   'q14': 'آیا مجوز از اداره مبارزه با پولشوئی در خصوص بیمه\u200cگزاران حقوقی فاقد کداقتصادی و شناسه ملی دریافت شده است؟',
                                   'q15': 'در هنگام ثبت الحاقیه ارائه لیست اولیه می بایست مستندات به شرح زیر  بارگذاری گردد:\n1-  یک نسخه از قرارداد شامل تصویر بیمه نامه، شرایط خصوصی و عمومی\n2- نامه کتبی بیمه\u200cگزار  جهت ارائه لیست اولیه ممهور به مهر دبیرخانه و ثبت تاریخ  دریافت نامه از سوی بیمه\u200cگر\nبارگذاری  لیست اکسل اولیه دریافتی از بیمه\u200cگزار   و بارگذاری آن مانند سایر مستندات الحاقیه',
                                   'q16': 'تاریخ  شروع پوشش بیمه شدگان در الحاقیه ارائه لیست اولیه مطابق با مهلت مقرر در شرایط خصوصی قرارداد می باشد؟',
                                   'q17': 'در صورتی که ثبت الحاقیه ارائه لیست اولیه در مهلت مقرر در قرارداد نبوده، نامه عدم خسارت از سوی بیمه\u200cگزار و یا تایید مدیریت بیمه های زندگی در الحاقیه مربوطه بارگذاری گردیده است؟',
                                   'q18': 'تعداد بیمه شدگان مطابق با لیست اولیه از سوی بیمه\u200cگزار ثبت گردیده است درصورت داشتن نواقص موارد بصورت مکتوب به بیمه\u200cگزار جهت اصلاح  اعلام گردیده است؟',
                                   'q19': 'آیا یک نسخه از قرارداد اعم از بیمه نامه، شرایط عمومی و بیمه\u200cگر بیمه دی ، الحاقیه\u200cها و تفاهم\u200cنامه ممهور به مهر و امضای بیمه\u200cگر و بیمه\u200cگزار در تمامی صفحات در بایگانی موجود است؟',
                                   'q20': 'ثبت  تاریخ و تعداد سررسید حق\u200cبیمه های تولیدی در بیمه نامه براساس شرایط مورد توافق در شرایط خصوصی قرارداد ثبت شده است؟'
                               }},
"ExaminingTheLifeCost": {
  "detailName": "ExaminingTheLifeCost",
  "name_fa": "کاربرگ خسارت بیمه‌های زندگی",
                         "column_names": {
                             "Insurance_number": "شماره بیمه نامه",
                             "total_value": "کل حق بیمه",
                             'q1': '\tآیا فرم اعلام خسارت با تائید و احراز هویت توسط کارشناس صدور شعبه انجام و درج پرونده است؟',
                             'q2': '\tآیا چک لیست دریافت مدارک، توسط کارشناس شعبه با قید تاریخ و مهر شعبه تکمیل و بایگانی شده است؟',
                             'q3': '\tآیاکپی فرم پیشنهاد، بیمه\u200cنامه و جدول تعهدات امضاشده توسط بیمه\u200cگزار و بیمه\u200cگر دریافت و درج پرونده شده است؟',
                             'q4': '\tآیا گزارش و کروکی حادثه از مراجع قانونی با قید نام بیمه شده،تاریخ ،محل و چگونگی حادثه ممهور به مهر مرجع مربوطه دریافت شده است؟',
                             'q5': '\tآیا گواهینامه معتبر و متناسب با وسیله نقلیه، درصورتی که حادثه در اثر حوادث ترافیکی باشد دریافت شده است؟',
                             'q6': '\tآیا گواهی اولین مرجع درمانی که بیمه\u200cشده بلافاصله پس از وقوع حادثه به آن مراجعه نموده است دریافت شده است؟',
                             'q7': '\tآیا گواهی پزشک معالج مبنی بر وقوع حادثه و اقدامات پزشکی انجام شده دریافت و درج پرونده شده است؟',
                             'q8': '\tآیا گواهی پزشک معالج مبنی بر پایان معالجات و تائید نقص عضو بیمه\u200cشده دریافت شده است؟',
                             'q9': '\tآیا کلیه گزارش های پزشکی قانونی و تعیین درصد نقص  عضو نهایی (درصورتی که پرونده به پزشکی قانونی ارجاع شده است( دریافت شده است؟',
                             'q10': '\tآیا رادیوگرافی\u200cهای عضو/اعضای آسیب دیده مربوط به زمان حادثه و پس از درمان درج پرونده شده است؟',
                             'q11': '\tآیا مدارک شناسایی بیمه\u200cشده دریافت شده است؟',
                             'q12': 'تکمیل فرم گزارش کارشناسی خسارت به همراه شورای فنی خسارت شعبه '
                         }},
"ExaminingTheLifeIssuance": {
  "detailName": "ExaminingTheLifeIssuance",
  "name_fa": "کاربرگ صدور بیمه‌های زندگی",
                             "column_names": {
                                 "Insurance_number": "شماره بیمه نامه",
                                 "total_value": "کل حق بیمه",
                                 'q1': '\tآیا اصل فرم پیشنهاد تکمیل شده ممهور به مهر و امضای واحد صدور و معرف / بیمه\u200cگزار و بیمه\u200cشده دریافت شده است؟',
                                 'q2': '\tآیا فرم پیشنهاد فاقد خط خوردگی یا لاک گرفتگی می\u200cباشد؟',
                                 'q3': '\tآیا  تمام صفحات جدول تعهدات امضای شده طرفین موجود است؟',
                                 'q4': '\tآیا کارت شناسایی پزشکی( کپی کارت معافیت پزشکی در صورت نیاز) دریافت شده است؟',
                                 'q5': '\tآیا مدارک پزشکی(در صورت وجود) دریافت شده است؟',
                                 'q6': '\tنیاز به نسخه فیزیکی ممهور به مهر پزشک نمی باشد درختواره ارجاعات نامه که در آن پزشک معتمد ستاد و کارشناس ستاد نظر داده اند کفایت می کند(البته در صورتی که نیاز به بررسی پزشک معتمد ستاد داشته باشد)',
                                 'q7': '\tآیا  نسخه چاپی الحاقیه و جدول تعهدات امضا شده دریافت شده است؟',
                                 'q8': '\tآیا دریافت رسید تحویل بیمه\u200cنامه از نماینده دریافت شده است؟',
                                 'q9': '\tآیا برای صدور بیمه نامه اتباع خارجی، کپی پاسپورت/ کپی کارت آمایش،کپی کارت سلامت(در صورت وجود)  دریافت شده است؟',
                                 'q10': '\tآیا برای صدور بیمه نامه اتباع خارجی با اقامت موقت، متن موردتایید مدیریت بیمه\u200cهای زندگی در شرایط خصوصی درج شده است؟',
                                 'q11': '\tآیا کپی کارت اهداء عضو بیمه\u200cشده(بیمه\u200cنامه جانبخش) دریافت شده است؟',
                                 'q12': '\tآیا در زمان صدور الحاقیه تغییر معرف بیمه\u200cگزار، تاییدیه امور شعب و نمایندگان  دریافت شده است؟',
                                 'q13': '\tآیا امضای و نام پدر یا قیم قانونی برای بیمه\u200cشده فاقد اهلیت قانونی(زیر 18 سال) در بیمه نامه درج شده است؟',
                                 'q14': '\tآیا تایید کتبی بیمه\u200cگزار بر روی جدول تعهدات پیش از صدور بیمه\u200cنامه  و همچنین تاییدیه ستاد بابت اضافه نرخ پزشکی 100% یا بیشتر دریافت شده است؟',
                                 'q15': '\tلازم است نسبت بیمه گذار با بیمه شده سببی  یا نسبی باشد و در صورتیکه بیمه شده زیر سن قانونی (18سال) باشد لازم است بجای بیمه شده، ولی یا قیم قانونی امضا نماید) ',
                                 'q16': '\tآیا برای صدور الحاقیه تغییرمعرف، مجوزهای ستادی در بایگانی موجود می\u200cباشد؟',
                                 'q17': '\tآیا در صدور الحاقیه(دارای بار مالی/بدون بار مالی/تغییرمعرف)، مدارک شناسایی بیمه\u200cگزار و فرم درخواست تغییرات و فرم گواهی سلامت(در صورت نیاز) دریافت شده است؟',
                                 'q18': '\tآیا مدارک شناسایی و احراز هویت بیمه\u200cگزار توسط شعبه یا نماینده جهت صدور الحاقیه\u200cها دریافت شده است؟',
                                 'q19': '\tآیا در زمان برگشت بیمه نامه بحالت جاری، فرم درخواست بهره مندی از منافع و فرم گواهی سلامت بیمه شده تکمیل و دریافت شده است؟',
                                 'q20': '\tآیا در صورت داشتن پوشش معافیت از پرداخت حق بیمه از سوی بیمه\u200cشده یا بیمه\u200cگزار، فرم گواهی سلامت تکمیل و دریافت شده است؟',
                                 'q21': '\tآیا در زمان بازخریدی بیمه\u200cنامه، اصل بیمه نامه و الحاقیه\u200cهای مربوطه و فرم درخواست بهره\u200cمندی از منافع و پرینت الحاقیه صادره و حواله خسارت در بایگانی موجود می\u200cباشد؟',
                                 'q22': '\tآیا در صورت درخواست چاپ المثنی، کلمه المثنی روی سند بیمه\u200cنامه و جدول تعهدات درج و در بایگانی ( فرم درخواست- سند بیمه\u200cنامه- جدول تعهدات)نگهداری شده است؟',
                                 'q23': '\tآیا در زمان صدور وام بیمه نامه، مدارک لازم فرم بهره مدب از منافع آخرین ورژن به همراه حواله وام در بایگانی نگهداری شده است؟'
                             }},
"ExaminingTheHealthIssuance": {
  "detailName": "ExaminingTheHealthIssuance",
  "name_fa": "کاربرگ صدور درمان",
                               "column_names": {
                                   "Insurance_number": "شماره بیمه نامه",
                                   "total_value": "کل حق بیمه",
                                   'q1': 'آیا درخواست کتبی بیمه\u200cگزار در سربرگ خود، به همراه جدول تعهدات و تاریخ شروع برای اعلام نرخ یا شرکت در مناقصات ارائه شده است؟',
                                   'q2': 'آیا کلیه شرایط و استثنائات اعلامی  در خصوص حق\u200cبیمه، تعهدات بصورت کتبی از سوی شعبه به بیمه\u200cگزار اعلام گردیده است؟',
                                   'q3': 'آیا  نرخ و حق بیمه تائید شده، جدول تعهدات و شرایط پرداخت حق بیمه جهت صدور قرارداد (نامه صدور) از بیمه گزار دریافت شده است؟',
                                   'q4': 'آیا  اطلاعات ثبتی شرکت / سازمان\u200cهای تابعه از بیمه\u200cگزار دریافت شده است؟',
                                   'q5': 'آیا مدارک مورد نیاز از جمله روزنامه رسمی در خصوص قراردادهای  هلدینگ از بیمه\u200cگزار دریافت شده است؟',
                                   'q6': 'آیا تائیدیه کتبی تمامی شرایط خصوصی مورد توافق از جمله ثبت پدر و مادر غیر تحت تکفل با اضافه نرخ دریافت شده است؟ ',
                                   'q7': 'آیا آخرین لیست ممهور به مهر و امضا شده سازمان تامین اجتماعی شرکت / سازمانها  از بیمه\u200cگزار دریافت شده است؟',
                                   'q8': 'آیا مشخصات کامل بیمه\u200cشدگان و افراد تحت تکفل آنان در قالب لوح فشرده به شرکت ارائه شده است؟',
                                   'q9': ' آیا در زمان صدور، در متن نامه بیمه\u200cگزار موارد اعم از مشخص نمودن تاریخ شروع بیمه\u200cنامه، تعداد بیمه\u200cشدگان، حق بیمه خالص ماهیانه هر نفر، انتخاب طرح موردنظر، نام و کدمعرف بیمه\u200cنامه(نماینده/کارگزار) رعایت شده است؟',
                                   'q10': 'آیا یک نسخه از لیست کلیه بیمه شدگان قرارداد سال قبل مهمور به مهر و امضای بیمه\u200cگر قبلی (شامل مشخصات شناسنامه ای افراد و تاریخ شروع و پایان باشد) جهت دوره انتظار در بایگانی موجود است؟',
                                   'q11': 'آیا تصویر بیمه نامه سال قبل از بیمه\u200cگزار برای کنترل تاریخ شروع بیمه\u200cنامه، دریافت شده است؟ (در صورت داشتن بیمه نامه سال قبل) ',
                                   'q12': 'آیا استعلام بیمه\u200cگر پایه بیمه شدگان یا تاییدیه مراجع قانونی جهت تحت تکفل بودن والدین و سایر افراد، دریافت شده است؟',
                                   'q13': 'آیا در زمان تمدید بیمه نامه، یک نسخه گزارش از حق بیمه سررسیده شده/ وصول نشده و پیگیری وصول مطالبات سال قبل در سوابق نگهداری شده است؟',
                                   'q14': 'آیا تصویر گواهی پروانه فعالیت دارای اعتبار برای صدور بیمه نامه اصناف دریافت شده است؟',
                                   'q15': 'آیا کارت عضویت و یا مدارک مرتبط به عضویت برای صدور بیمه نامه اتحادیه دریافت شده است؟',
                                   'q16': 'آیا یک نسخه از قرارداد اعم از بیمه نامه، شرایط عمومی و بیمه\u200cگری بیمه دی، الحاقیه\u200cها و تفاهم\u200cنامه مهمور به مهر و امضای بیمه\u200cگر و بیمه\u200cگزار در تمامی صفحات در بایگانی موجود است؟',
                                   'q17': 'آیا حداقل 70% از اعضا همزمان بهمراه کلیه افراد تحت تکفل تحت پوشش بیمه قرار گرفته اند؟',
                                   'q18': 'آیا با تغییر تعداد بیمه شدگان نهایی بیشتر از 20% تعداد اعلامی، در نرخ اعلامی تجدید نظر صورت گرفته است؟',
                                   'q19': 'آیا مدت اعتبار حق بیمه\u200cهای اعلام شده از طرف شرکت، 20 روزکاری تمام رعایت شده است؟ ',
                                   'q20': 'آیا در کلیه الحاقیه ها، مستندات و مکاتبات بیمه\u200cگزار پیوست آن الحاقیه بایگانی شده است؟',
                                   'q21': 'آیا  در زمان بیمه نامه درمان، تجمیع امور بیمه\u200cای رعایت شده است؟',
                                   'q22': 'آیا قبل از ثبت بیمه\u200cگزار در سیستم رسا، در سیستم فناوران مشخصات بیمه\u200cگزار ثبت شده است؟',
                                   'q23': 'آیا کلیه مستندات اعم از فیش واریزی و یا تصویر چک دریافتی بیمه\u200cگزار در بایگانی صدور موجود است؟',
                                   'q24': 'آیا  مستندات لازم برای تحت پوشش قرارداد دادن فرزندان ذکور بالای 20 سال  تمام و فرزندان اناث  دریافت شده است؟',
                                   'q25': 'آیا به منظور یکسان\u200cسازی در شرح الحاقیه\u200cها، به تفکیک نوع الحاقیه صادره، شرح الحاقیه مطابق با شیوه نامه رعایت شده است؟',
                                   'q26': 'آیا جهت افزایش، کاهش یا ویرایش بیمه شدگان در طول قرارداد مستندات مورد نیاز از بیمه گزار دریافت و بایگانی شده است؟',
                                   'q27': 'آیا جهت افزایش یا کاهش بیمه شدگان مهلت\u200cهای زمانی اعلامی در بیمه\u200cنامه رعایت شده است؟'
                               }},
"ExaminingTheLiabilityCost": {
  "detailName": "ExaminingTheLiabilityCost",
  "name_fa": "بررسی عملیات خسارت بیمه های مسئولیت",
                              "column_names": {
                                  "Insurance_number": "شماره بیمه نامه",
                                  "total_value": "کل حق بیمه",
                                  'q1': 'کنترل اعلام خسارت توسط بیمه گزار ',
                                  'q2': ' کنترل ثبت اعلام خسارت در دفتر اندیکاتور',
                                  'q3': 'کنترل الحاق گزارش کارشناسی و کیفیت طبق ابلاغیه ارسالی به پرونده',
                                  'q4': ' کنترل اخذ مدارک شناسائی زیان دیده',
                                  'q5': 'کنترل الحاق فرم صورتحساب تفصیلی یا فرم استعلام وصول حق بیمه',
                                  'q6': 'آیا حق بیمه در موعد مقرر تسویه و پرداخت شده است؟',
                                  'q7': 'کنترل الحاق پروانه ساخت در صورت نیاز',
                                  'q8': ' کنترل الحاق رونوشت بیمه نامه',
                                  'q9': 'کنترل الصاق رونوشت فرم پیشنهاد',
                                  'q10': 'کنترل الحاق فرم بازدید در صورت لزوم',
                                  'q11': 'کنترل وجود دو امضاء مجاز در حواله خسارت و تائید پرداخت خسارت ',
                                  'q12': 'کنترل الحاق رضایتنامه یا رسید خسارت واگذاری حقوق بیمه گزار',
                                  'q13': ' کنترل رونوشت مبایعنامه یا سند',
                                  'q14': 'کنترل الحاق فرم آنالیز خسارت به همراه اعلام نظر فنی و تائید پرداخت',
                                  'q15': 'کنترل وجود امضاء های مجاز در فرم آنالیز خسارت',
                                  'q16': 'کنترل الحاق قرارداد کارگر با کارفرما در صورت لزوم',
                                  'q17': ' کنترل الحاق لیست تامین اجتماعی زیاندیده به پرونده در صورت وجود',
                                  'q18': 'کنترل الحاق رای دادگاه به پرونده در صورت لزوم و تاریخ ارائه رای',
                                  'q19': 'کنترل الحاق تمامی نظریات پزشکی قانونی به پرونده',
                                  'q20': 'کنترل الحاق برگه های بازجویی و گزارشات کلانتری به پرونده',
                                  'q21': 'کنترل الحاق مدارک پزشکی به پرونده',
                                  'q22': 'کنترل درج دو امضاء مجاز در حواله تسویه کارشناسی',
                                  'q23': 'کنترل اعمال قاعده نسبی',
                                  'q24': 'کنترل دریافت داغی',
                                  'q25': 'کنترل دریافت مجوز طبابت در بیمه نامه های پزشکان و پیرا پزشکان',
                                  'q26': 'کنترل مدارک بیمارستانی',
                                  'q27': 'کنترل گواهی استاندارد',
                                  'q28': 'کنترل مجوز مهد کودک',
                                  'q29': 'استعلام از سوابق خسارتی بیمه نامه',
                                  'q30': ' خسارتهای که از زمان وقوع حادثه بیش از 14 روز گذشته و اعلام شده است آیا فرم شماره 2 تکمیل شده است؟',
                                  'q31': 'در صورتجلسه تنظیم شده توسط کارشناس آیا مواردی از قبیل : علت و چگونگی وقوع حادثه ، اصالت حادثه ، زمان و مکان وقوع حادثه ، تعداد کارگزان ، متراز ساختمان ، نام کارفرما و پیمانکار ، میزان قصور طرفین و .... ',
                                  'q32': 'کنترل فاکتور',
                                  'q33': 'کنترل قبض برق',
                                  'q34': 'کنترل مدت زمان تکمیل پرونده تا تاریخ پرداخت خسارت'
                              }},
"ExaminingTheLiabilityIssuance": {
  "detailName": "ExaminingTheLiabilityIssuance",
  "name_fa": "بررسی عملیات صدور بیمه های مسئولیت",
                                  "column_names": {
                                      "Insurance_number": "شماره بیمه نامه",
                                      "total_value": "کل حق بیمه",
                                      'q1': 'آیا فرم پیشنهاد ، درخواست تمدید ، یا نامه ای برنده شدن در مناقصه و یا نامه در خواست صدور   ضمیمه  گردیده است ؟',
                                      'q2': 'در صورت حقوقی بودن بیمه گزار ، آیا درخواست صدور با مهر و امضاء بیمه گزار در تمامی صفحات می باشد.',
                                      'q3': 'در صورت حقیقی بودن بیمه گزار ، آیا درخواست صدور با مهر و امضاء بیمه گزار در تمامی صفحات می باشد.',
                                      'q4': 'در صورتی که مکان فعالیت بیمه گزار مشخص نیست ، آیا بیمه نامه با نام صادر شده است؟',
                                      'q5': 'در صورتی که آدرس محل فعالیت مشخص نیست ، آیا پلاک و یا کد پستی است؟',
                                      'q6': 'در صورتی که با نام صادر شده است آیا اسامی ضمیمه شده است؟',
                                      'q7': 'آیا فرم پیشنهاد با بیمه نامه صادره تطابق دارد؟',
                                      'q8': 'آیا شرایط خصوصی بیمه نامه  های که دارای شیوه نامه های ایلاغی می باشد ، درج گردیده است؟',
                                      'q9': 'در صورتی که کلوز مامورین خارج از کارگاه اعطا گردیده است  آیا اسامی در شرایط خصوصی درج گردیده است؟',
                                      'q10': 'آیا حق بیمه و اعلام بدهکار بیمه نامه مطابق با آئین نامه تقسیط می باشد؟',
                                      'q11': 'آیا شرایط پرداخت حق بیمه در شرایط خصوصی بیمه نامه درج گردیده است؟',
                                      'q12': 'آیا رسید وصول حق بیمه در پرونده وجود دارد؟',
                                      'q13': 'آیا مدرک واریز حق بیمه در پرونده وجود دارد؟',
                                      'q14': 'آیا مدرک شناسائی بیمه گزار ضمیمه می باشد؟',
                                      'q15': 'در صورت ارائه تخفیف عدم خسارت ، آیا استعلام سنواتی بودن عدم خسارت اخذ گردیده است؟',
                                      'q16': 'در بیمه نامه های پزشکان و پیرا پزشکان آیا مدرک تحصیلی یا کارت نظام پزشکی ضمیمه می باشد؟',
                                      'q17': 'آیا در بیمه نامه های پزشکان و پیرا پزشکان یک آدرس مشخص از بیمه گزار اخذ گردیده است؟',
                                      'q18': 'آیا حداقل حق بیمه به میزان 1.000.000 ریال در بیمه نامه های پزشکان و پیرا پزشکان رعایت گردیده است؟',
                                      'q19': 'آیا پروانه ساختمانی در رشته کارفرما در قبال کارکنان ضمیمه گردیده است؟',
                                      'q20': 'در صورتی که پروانه ضمیمه نیست ، آیا 15% تشدید خطر عدم وجود جواز لحاظ گردیده است؟',
                                      'q21': 'در بیمه نامه ای ابنیه در صورت وجود تعهد مالی آیا بازدید انجام شده است؟',
                                      'q22': 'در صورتی که عمق گود برداری بیش از حدود اختیارات شعبه می باشد ، آیا کارشناس رسمی دادگستری بازدید را انجام داده است؟',
                                      'q23': 'آیا مهر و امضاء معرف در فرم پیشنهاد وجود دارد؟',
                                      'q24': 'در صورت وجود الحاقیه آیا مستندات کتبی صدور الحاقیه ضمیمه می باشد؟',
                                      'q25': 'آیا بیمه نامه طبق قرارداد صادر گردیده است؟',
                                      'q26': 'آیا فرانشیز و مبلغ آن در بیمه نامه درج گردیده است؟'
                                  }},
"ExaminingTheEngineeringCost": {
  "detailName": "ExaminingTheEngineeringCost",
  "name_fa": "بررسی عملیات خسارت مهندسی",
                                "column_names": {
                                    "Insurance_number": "شماره بیمه نامه",
                                    "total_value": "کل حق بیمه",
                                    'q1': 'آیا اعلام خسارت توسط بیمه گزار انجام شده است؟',
                                    'q2': 'آیا فرم یا نامه اعلام خسارت در دفتر اندیکاتور شعبه ثبت گردیده است؟',
                                    'q3': 'آیا صورتحساب تفصیلی بیمه نامه اخذ گردیده است؟',
                                    'q4': 'صرف نظر از قابل پرداخت بودن یا نبودن خسارت، حداکثر ظرف مدت سه روز از تاریخ اعلام خسارت ، پرونده می بایست در سیستم فناوران با نام کاربری کارشناس محترم خسارت شعبه ثبتگردد آیا موارد فوق رعایت گردیده است.',
                                    'q5': 'آیا مبلغ برآوردی خسارت در برنامه فناوران درج گردیده است؟',
                                    'q6': 'پیمان و ضمائم )توافقنامه ، نقشه ها ، فهرست بها و...(',
                                    'q7': 'آخرین صورت وضعیت کارکرد به رسم امانت',
                                    'q8': 'اصل صورت وضعیت خسارت که به تائید دستگاه نظارت و کارفرما رسیده باشد',
                                    'q9': 'عکس و فیلم از مواضع آسیب دیده',
                                    'q10': 'ازمان سازمان هواشناسی در ارتباط با وقوع سیل، طوفان و صاعقه که در آن وضعیت جوی و میزان سرعت باد در محل حادثه با ذکر تاریخ و ساعت درج گردیده باشد.',
                                    'q11': 'سازمان آتش نشانی و خدمات ا ی منی منطقه به منظور بررس ی علت فنی و گزارش کی فی وقوع آتش سوزی یا انفجار',
                                    'q12': 'مؤسسه ژئوفیزیک در ارتباط با وقوع زلزله و موارد مشابه',
                                    'q13': 'استعلام از سایر شرکت های بیمه برای کلیه حوادث ناشی از جریان برق و یا گاز الزامی بوده و در سایر حوادث تا سقف مبلغ خسارت 50.000.000 ریال نیاز نمیباشد . آیا موارد فوق رعایت گردیده است؟',
                                    'q14': '" فرم آنالیز پرونده خسارت " با امضاء کارشناس ، معاونت و مد یریت محترم شعبه(حداقل دو امضاء ) ضمیمه پرونده گردد.',
                                    'q15': 'آیا مدارک با فرمت pdf در فناوران بارگزاری شده است؟',
                                    'q16': 'در صورتی که مبلغ خسارت قابل پرداخت از 1.000.000.000 ریال بیشتر باشد اخذ رضایت نامه محضری از گیرنده حواله الزامیست.آیا موارد فوق رعایت گردیده است؟',
                                    'q17': 'در خصوص خسارت های مربوط به سازمان ها و ارگان های دولتی در صورتی که مبلغ خسارت بیشتر از 1.000.000.000 ریال باشد نیاز به اخذ رضایت نامه محضری نبوده اما مبلغ خسارت می بایست بعد از مکاتبه توسط بیمه گذار کتبا مورد تائید قرار گیرد .آیا موارد فوق رعایت گردیده است؟',
                                    'q18': 'اسناد تعیین متراژ و ارزش ساختمان آسیب دیده به تفکیک نوع کاربری، سال ساخت، پلان ساختمان، نوع سازه',
                                    'q19': 'اسناد تعیین متراژ و ارزش کلیه ساختمان های موجود در بیمه نامه به تفکیک نوع کاربری، سال ساخت، پلان ساختمان، نوع سازه',
                                    'q20': 'فهرست اقلام خسارت دیده و سالم به صورت مبالغ تفکیکی، تهیه شده توسط بیمه گزار ممهور به مهر و امضاء وی',
                                    'q21': 'پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گزار',
                                    'q22': 'مدارک مشخصات فنی دستگاه آسیب دیده شامل سال ساخت ، کشور سازنده ، سال بهره برداری و ....',
                                    'q23': 'پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گزار',
                                    'q24': 'مدارک مشخصات فنی دستگاه آسیب دیده شامل سال ساخت ، کشور سازنده ، سال بهره برداری و ....',
                                    'q25': 'پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گزار',
                                    'q26': 'مدارک مشخصات فنی دستگاه آسیب دیده شامل سال ساخت ، کشور سازنده ، سال بهره برداری و ....',
                                    'q27': 'پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گزار',
                                    'q28': 'مدارک مشخصات فنی دستگاه آسیب دیده شامل سال ساخت ، کشور سازنده ، سال بهره برداری و ....',
                                    'q29': 'پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گزار',
                                    'q30': 'مدارک مشخصات فنی دستگاه آسیب دیده شامل سال ساخت ، کشور سازنده ، سال بهره برداری و ....',
                                    'q31': 'پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گزار',
                                    'q32': 'مدارک مشخصات فنی دستگاه آسیب دیده شامل سال ساخت ، کشور سازنده ، سال بهره برداری و ....',
                                    'q33': 'پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گزار',
                                    'q34': 'مدارک مشخصات فنی دستگاه آسیب دیده شامل سال ساخت ، کشور سازنده ، سال بهره برداری و ....',
                                    'q35': 'پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گزار',
                                    'q36': 'مدارک مشخصات فنی دستگاه آسیب دیده شامل سال ساخت ، کشور سازنده ، سال بهره برداری و ....',
                                    'q37': 'پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گزار',
                                    'q38': 'مدارک مشخصات فنی دستگاه آسیب دیده شامل سال ساخت ، کشور سازنده ، سال بهره برداری و ....',
                                    'q39': 'پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گزار',
                                    'q40': 'مدارک مشخصات فنی دستگاه آسیب دیده شامل سال ساخت ، کشور سازنده ، سال بهره برداری و ....',
                                    'q41': 'پروفرما و برگ سبز گمرکی جهت ماشین آلات خارجی و فاکتور خرید ماشین آلات داخلی ممهور به مهر و امضاء بیمه گزار',
                                    'q42': 'مدارک مشخصات فنی دستگاه آسیب دیده شامل سال ساخت ، کشور سازنده ، سال بهره برداری و ....',
                                    'q43': 'آیا مدارک مربوط به آخرین اورهال و تعمیرات اساسی اخذ شده است؟',
                                    'q44': 'آیا ساعت کارکرد دستگاه های خسارت دیده  مدارک لازم مربوطه و ساعت کارکزد مفید دستگله ها اخذ شدهاست؟'
                                }},
"ExaminingTheEngineeringIssuanceT": {
  "detailName": "ExaminingTheEngineeringIssuanceT",
  "name_fa": "بررسی عملیات صدور رشته مهندسی تمام خطر نصب و پیمانکاری",
                                     "column_names": {
                                         "Insurance_number": "شماره بیمه نامه",
                                         "total_value": "کل حق بیمه",
                                         'q1': 'آیا کپی قرارداد یا موافقتنامه اخذ گردیده است؟',
                                         'q2': 'آیا کپی جدول زمانبندی اجرای پروژه اخذ گردیده است؟',
                                         'q3': 'آیا کپی نقشه محل یا مسیر پروژه اخذ گردیده است؟',
                                         'q4': 'آیا پرسشنامه تکمیل شده با مهر و امضاء بیمه گزار اخذ شده است؟',
                                         'q5': 'آیا لیست اقلام مورد نصب با مشخصات تعداد و ارزش جایگزینی آنها اخذ گردیده است؟',
                                         'q6': 'پروژه هایی که عملیات اجرایی آن عملیات نگهداری ، تعمیرات و بهره برداری می باشد از قبیل آبیاری، کنتورخوانی ، بهره برداری و نگهداری تاسیسات و تجهیزات گاز ، آب ، برق و .... پوشش بیمه ای برای آن قابل ارائه نمی باشد . آیا موارد فوق رعایت گردیده است؟ در صورت صدور مجوز ستاد اخذ شده است؟',
                                         'q7': 'در صورتی که بیمه نامه دارای خسارت بوده برای تمدید از ستاد مجوز اخذگردیده است؟',
                                         'q8': 'آیا بازدید قبل از صدور بیمه نامه  انجام شده است؟',
                                         'q9': 'آیا بارگزاری  گزارش بازدید به همراه عکسهای بازدید اولیه در سیستم فناوران انجام شده است؟',
                                         'q10': 'اعلام نمودن کل مبلغ پیمان یا هزینه نصب جهت پوشش بیمه نامه تمام خطر الزامی است. آیا موارد فوق رعایت گردیده است؟',
                                         'q11': 'در پروژه های لوله گذاری و هر نوع پروژه ای که امکان کانال کنی و لوله گذاری وجود دارد از کلوز ۲۱7 حتماً استفاده گردد آیا موارد فوق رعایت گردیده است؟',
                                         'q12': 'در صورت تحت پوشش بودن خسارت مالی مسئولیت مدنی در قبال اشخاص ثالث ( بخش ۲ ) ارائه کلوز ۲08 الزامی است. آیا موارد فوق الزامی است؟',
                                         'q13': 'در صورتیکه بیمه گذار در فرم پیشنهاد هزینه های اضافی مربوط به اضافه کاری در شب و درایام تعطیلات عمومی را درخواست کرده باشد ارائه کلوز 006 الزامی است. آیا موارد فوق رعایت گردیده است؟',
                                         'q14': 'در صورت تحت پوشش داشتن دوره نگهداری انتخاب کلوز 003 و یا کلوز 00۴ الزامی است. آیا موارد فوق رعایت گردیده است؟',
                                         'q15': 'در بیمه نامه های تمام خطر انتخاب فرانشیز " خسارت ناشی از حوادث طبیعی " و "خسارات ناشی از سایر حوادث در بخش یک بیمه نامه" الزامی می باشد . آیا موارد فوق رعایت گردیده است؟',
                                         'q16': 'تائیدیه پیش نویس توسط بیمه گزار اخذ شده است',
                                         'q17': 'درج شرایط پرداخت حق بیمه) تاریخ و مبلغ پرداختی ( درفیلد متن کاربر شرایط خصوصی تمام خطر نصب الزامی است . آیا موارد فوق رعایت گردیده است؟',
                                         'q18': 'خلاصه برآورد مالی پروژه (پیمانکاری)',
                                         'q19': 'در صورت تحت پوشش بودن برداشت ضایعات ارائه کلوز 020 الزامی است و حد آن نیز با توجه به سرمایه تحت پوشش درج گردد(پیمانکاری)',
                                         'q20': 'در صورت تحت پوشش بودن اموال مجاور ارائه کلوز 119 الزامی است (پیمانکاری)'
                                     }},
"ExaminingTheEngineeringIssuanceMachineFailure": {
  "detailName": "ExaminingTheEngineeringIssuanceMachineFailure",
  "name_fa": "بررسی عملیات صدور رشته مهندسی شکست ماشین آلات",
                                                  "column_names": {
                                                      "Insurance_number": "شماره بیمه نامه",
                                                      "total_value": "کل حق بیمه",
                                                      'q1': 'پرسشنامه تکمیل شده با مهر و امضاء بیمه گزار اخذ شده است؟',
                                                      'q2': 'لیست ماشین آلات مورد بیمه با مشخصات (شامل نوع، مدل، سازنده، سال ساخت، ظرفیت، شماره سریال،شماره موتور و ارزش جایگزینی نو) اخذ شده است؟',
                                                      'q3': 'در صورتی که بیمه نامه جهت تمدید دارای خسارت باشد آیا از ستاد مجوز صدور اخذ شده است؟',
                                                      'q4': 'آیا بازدید قبل از صدور بیمه نامه  انجام شده است؟',
                                                      'q5': 'آیا بارگزاری  گزارش بازدید به همراه عکسهای بازدید اولیه در سیستم فناوران انجام شده است؟',
                                                      'q6': 'دریافت لیست تفکیکی از ماشین آلات مورد بیمه شامل نوع دستگاه ، شماره موتور ، شماره شاسی ، شماره سریال ، سال ساخت و ارزش مورد بیمه الزامی است . آیا موارد فوق رعایت گردیده است؟',
                                                      'q7': 'اعتبار بازدید از ماشین آلات تنها 24 ساعت از تاریخ صدور میباشد و میبایست بیمه نامه در اسرع وقت صادر گردد . آیا موارد فوق رعایت گردیده است؟',
                                                      'q8': 'در صورت تحت پوشش داشتن مسئولیت مدنی در قبال اشخاص ثالث انتخاب کلوز 302 الزامی است . آیا موارد فوق رعایت گردیده ست؟',
                                                      'q9': 'بعد از محاسبه حق بیمه و قبل از صدور بیمه نامه یک نسخه چاپ آزمایشی از اطلاعات درج شده و حق بیمه محاسبه شده در سیستم جهت تأیید نهایی و بازنگری مجدد به بیمه گزار ارائه گردد.آیا موارد فوق رعایت گردیده است؟',
                                                      'q10': 'آیا شرایط پزداخت حق بیمه در شرایط خصوصی درج گردیده است؟',
                                                      'q11': 'آیا رسید تحویل تمامی مدارک  از بیمه گزار اخذ گردد است ؟ ',
                                                      'q12': 'صدور بیمه نامه برای ماشین آلات با طول عمر بیشتر از 15 سال بدون مجوز ستاد امکان پذیر نمی باشد . آیا موارد فوق رعایت گردیده است؟',
                                                      'q13': 'صدور بیمه نامه برای جایگاه های بنزین و CNG بدون مجوز ستاد امکان پذیر نمی باشد. آیا موارد فوق رعایت گردیده است؟',
                                                      'q14': 'تردد مورد بیمه در جاده های بین شهری و یا هر جایی غیر از محدوده جغرافیایی مشخص شده تحت پوشش نمیباشد که در صورت درخواست بیمه گزار میتوان کلوز 401 را با افزایش حق بیمه ارائه نمود. آیا موارد فوق رعایت گردیده است؟ (پیمانکاری)'
                                                  }},

  }


  // Check if detailName is valid and exists in CHECKLIST_DATA
  if (!detailName || !CHECKLIST_DATA[detailName]) {
    return <div>Section not found or undefined.</div>;
  }

  // Get the questions for the detailName
  const questions = CHECKLIST_DATA[detailName].column_names;

  return (
    <div className="fixed inset-0 flex justify-center items-center z-50">
      <div className="fixed inset-0 bg-black bg-opacity-50"></div>
      <div className="fixed top-1/2 left-1/2 transform -translate-x-1/2 -translate-y-1/2 bg-white p-5 rounded-lg max-h-[600px] overflow-auto w-[1100px] h-[600px]" dir="rtl">
        <div className="relative">
        <button onClick={onClose} className="absolute top-0 left-0 m-2 bg-red-500 text-white rounded-full w-8 h-8 flex items-center justify-center hover:bg-red-700">X</button>
          <form onSubmit={handleSubmit} className="space-y-4">
            <div className='mr-8'>
              <label htmlFor="insurance_number" className="block">شماره بیمه نامه</label>
              <input
                id="insurance_number"
                name="insurance_number"
                type="text"
                value={formData.insurance_number || ''}
                onChange={handleChange}
                className="border border-gray-300 rounded px-2 py-1"
              />
            </div>
            <div className='mr-8'>
              <label htmlFor="total_cost" className="block">مبلغ</label>
              <input
                id="total_cost"
                name="total_cost"
                type="number"
                value={formData.total_cost || ''}
                onChange={handleChange}
                className="border border-gray-300 rounded px-2 py-1"
              />
            </div>
            {Object.entries(questions).map(([questionKey, questionText], index) => (
              (questionKey !== 'Insurance_number' && questionKey !== 'مبلغ') && (
                <div key={questionKey} className="flex items-center space-x-4">
                  <span className="mx-2 text-[color:var(--color-primary-variant)]">{index + 1}-</span>
                  <label htmlFor={questionKey} className='bg-slate-100 p-5 rounded-lg'>{questionText}</label>
                  <div className="flex items-center">
                    <input
                      id={questionKey + '_yes'}
                      name={questionKey}
                      type="radio"
                      value="true"
                      checked={formData[questionKey] === 'true'}
                      onChange={handleChange}
                      className="hidden"
                    />
                    <label htmlFor={questionKey + '_yes'} className={`mx-1 cursor-pointer flex items-center justify-center rounded-full w-8 h-8 border border-gray-300 ${formData[questionKey] === 'true' ? 'bg-blue-100' : ''} hover:bg-blue-100 transition-colors`}>
                      <span className="text-sm">بله</span>
                    </label>
                    <input
                      id={questionKey + '_no'}
                      name={questionKey}
                      type="radio"
                      value="false"
                      checked={formData[questionKey] === 'false'}
                      onChange={handleChange}
                      className="hidden"
                    />
                    <label htmlFor={questionKey + '_no'} className={`mx-1 cursor-pointer flex items-center justify-center rounded-full w-8 h-8 border border-gray-300 ${formData[questionKey] === 'false' ? 'bg-[color:var(--color-primary-variant-02)]' : ''} hover:bg-[color:var(--color-primary-variant-02)] transition-colors`}>
                      <span className="text-sm">خیر</span>
                    </label>
                  </div>
                </div>
              )
            ))}
            <button type="submit" className="bg-[color:var(--color-bg-variant)] hover:bg-[color:var(--color-primary)] text-white font-bold py-2 px-4 rounded">
              ارسال
            </button>
          </form>
        </div>
      </div>
    </div>
  );
}

export default Modal;